Tools/test-junit.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-01 Thu 16:24 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Test/JUnit</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Test/JUnit</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org32eb2ba">1. 单元测试</a></li>
<li><a href="#orgb7f412b">2. JUnit 基本使用</a></li>
<li><a href="#org83b8775">3. JUnit 高级</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org32eb2ba" class="outline-2">
<h2 id="org32eb2ba"><span class="section-number-2">1</span> 单元测试</h2>
<div class="outline-text-2" id="text-1">
<p>
相关问题:
</p>
<ul class="org-ul">
<li>什么是测试？</li>
<li>测试的分类有哪些？</li>
<li>单元测试的作用是什么？</li>
<li>常见的单元测试框架有哪些？</li>
<li>简述 JUnit 与 TestNG 区别</li>
<li>什么是 TDD？它有哪些优点与缺点？</li>
</ul>
</div>
</section>

<section id="outline-container-orgb7f412b" class="outline-2">
<h2 id="orgb7f412b"><span class="section-number-2">2</span> JUnit 基本使用</h2>
<div class="outline-text-2" id="text-2">
<p>
首先，在项目中添加相关依赖:
</p>
<div class="org-src-container">
<pre class="src src-sgml"><span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#20351;&#29992;&#30340;&#26159; JUnit4 </span><span class="org-comment-delimiter">--&gt;</span>
<span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#27880;&#24847;&#65292;&#22312; Maven &#39033;&#30446;&#20013;&#65292;jar &#21253;&#30340; scope &#35774;&#32622;&#20026; test </span><span class="org-comment-delimiter">--&gt;</span>
<span class="org-comment-delimiter">&lt;!--</span><span class="org-comment">&#37027;&#20040;&#36825;&#20123; jar &#21253;&#23558;&#21482;&#20250;&#22312;&#27979;&#35797;&#30340;&#26102;&#20505;&#29983;&#25928;&#65292;&#24182;&#19981;&#20250;&#26368;&#32456;&#25171;&#21253;&#21040; tomcat &#26381;&#21153;&#22120;&#19978; </span><span class="org-comment-delimiter">--&gt;</span>
&lt;<span class="org-function-name">dependency</span>&gt;
  &lt;<span class="org-function-name">groupId</span>&gt;junit&lt;/<span class="org-function-name">groupId</span>&gt;
  &lt;<span class="org-function-name">artifactId</span>&gt;junit&lt;/<span class="org-function-name">artifactId</span>&gt;
  &lt;<span class="org-function-name">version</span>&gt;4.12&lt;/<span class="org-function-name">version</span>&gt;
  &lt;<span class="org-function-name">scope</span>&gt;test&lt;/<span class="org-function-name">scope</span>&gt;
&lt;/<span class="org-function-name">dependency</span>&gt;
</pre>
</div>

<p>
然后就可以使用了。基本的示例如下:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">DemoTest</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#22914;&#26524;&#38656;&#35201;&#36755;&#20986;&#26085;&#24535;&#20449;&#24687;&#30340;&#22320;&#26041;&#65292;&#23613;&#37327;&#20351;&#29992; logger&#65292;&#36991;&#20813; System.out</span>
    <span class="org-keyword">static</span> <span class="org-type">Logger</span> <span class="org-variable-name">logger</span> = Logger.getLogger(DemoTest.<span class="org-keyword">class</span>);

    <span class="org-c-annotation">@BeforeClass</span>
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">setUp</span> () {
        logger.debug(<span class="org-string">"@BeforeClass &#27880;&#35299;&#30340;&#26041;&#27861;&#65292;&#20250;&#22312;&#27979;&#35797;&#31867;&#21019;&#24314;&#21518;&#39318;&#20808;&#34987;&#25191;&#34892;&#12290;&#23427;&#21482;&#20250;&#34987;&#25191;&#34892;&#19968;&#27425;&#12290;"</span>);
        logger.debug(<span class="org-string">"&#23427;&#32463;&#24120;&#29992;&#26469;&#23545;&#20840;&#23616;&#23545;&#35937;&#36827;&#34892;&#21021;&#22987;&#21270;&#65292;&#25110;&#32773;&#36827;&#34892;&#36164;&#28304;&#30340;&#21152;&#36733;&#31561;&#12290;"</span>);
    }

    <span class="org-c-annotation">@AfterClass</span>
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">tearDown</span>() {
        logger.debug(<span class="org-string">"@AfterClass &#29992;&#22312;&#25152;&#26377;&#27979;&#35797;&#37117;&#25191;&#34892;&#23436;&#20043;&#21518;"</span>);
        logger.debug(<span class="org-string">"&#23427;&#32463;&#24120;&#29992;&#26469;&#25910;&#25342;&#27531;&#23616;&#12290;&#27604;&#22914;&#65292;&#37322;&#25918;&#25968;&#25454;&#24211;&#36830;&#25509;&#31561;"</span>);
    }

    <span class="org-c-annotation">@Before</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">everySetup</span>() {
        logger.debug(<span class="org-string">"@Before &#25110; @After &#20250;&#22312;&#27599;&#19968;&#20010;&#27979;&#35797;&#26041;&#27861;&#36816;&#34892;&#21069;&#21518;&#37117;&#20250;&#25191;&#34892;&#19968;&#27425;&#12290;"</span>);
        logger.debug(<span class="org-string">"&#23427;&#32463;&#24120;&#29992;&#26469;&#23545;&#23646;&#24615;&#36827;&#34892;&#36171;&#20540;&#65292;&#21021;&#22987;&#21270;&#23545;&#35937;&#29366;&#24577;&#31561;"</span>);
    }

    <span class="org-c-annotation">@Test</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">first</span>() {
        logger.debug(<span class="org-string">"@Test &#26631;&#27880;&#30340;&#26041;&#27861;&#65292;&#23601;&#26159;&#35201;&#36827;&#34892;&#21333;&#20803;&#27979;&#35797;&#30340;&#26041;&#27861;&#12290;&#22914;&#26524;&#27809;&#34987;&#26631;&#24535;&#65292;&#37027;&#20040;&#23558;&#19981;&#20250;&#34987;&#33258;&#21160;&#27979;&#35797;&#12290;"</span>);

        <span class="org-type">assert</span> <span class="org-variable-name">aaa</span> == bbb;       <span class="org-comment-delimiter">// </span><span class="org-comment">&#36890;&#29992;&#30340; assert &#26041;&#27861;&#65292;&#29992;&#26469;&#23545;&#39044;&#26399;&#32467;&#26524;&#36827;&#34892;&#8220;&#26029;&#35328;&#8221;&#12290;&#27979;&#35797;&#36890;&#36807;&#30340;&#26631;&#24535;&#26159;&#65292;&#25152;&#26377;&#26029;&#35328;&#37117;&#26159;&#23545;&#30340;&#65292;&#21363;&#36820;&#22238; true</span>
        Assert.assertTrue(aaa);  <span class="org-comment-delimiter">// </span><span class="org-comment">&#31561;&#21516;&#20110; assert aaa == true; &#22312; Assert &#31867;&#20013;&#65292;&#25552;&#20379;&#20102;&#24456;&#22810;&#31867;&#20284;&#30340;&#26041;&#27861;&#65292;&#29992;&#26469;&#31616;&#21270;&#26029;&#35328;&#35821;&#27861;</span>

        <span class="org-comment-delimiter">// </span><span class="org-comment">Assert.assertEquals()</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Assert.assertFalse()</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Assert.assertNull()</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Assert.assertSame()</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Assert.assertThat()</span>

        <span class="org-comment-delimiter">// </span><span class="org-comment">assertThat &#38750;&#24120;&#28789;&#27963;&#65292;&#21487;&#20197;&#32467;&#21512; hamcrest.jar &#19968;&#36215;&#20351;&#29992;&#65292;&#36827;&#34892;&#28789;&#27963;&#21305;&#37197;</span>
        <span class="org-keyword">import</span> <span class="org-keyword">static</span>  <span class="org-constant">org</span>.<span class="org-constant">hamcrest</span>.<span class="org-constant">CoreMatchers</span>.*;

        assertThat(aaa, both(containsString(<span class="org-string">"a"</span>)).and(containsString(<span class="org-string">"b"</span>)));
        assertThat(lst, hasItems(<span class="org-string">"one"</span>, <span class="org-string">"three"</span>));
        assertThat(aaa, anyOf(equalTo(<span class="org-string">"good"</span>), startWith(<span class="org-string">"good"</span>)));
    }


    <span class="org-c-annotation">@Test</span>(timeout = 1000,                <span class="org-comment-delimiter">// </span><span class="org-comment">&#35774;&#32622;&#36229;&#26102;&#26102;&#38388;</span>
          expected = SqlException.<span class="org-keyword">class</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">&#39044;&#26399;&#27979;&#35797;&#26041;&#27861;&#20250;&#25243;&#20986;&#36825;&#20010;&#24322;&#24120;</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">second</span>() {
        logger.debug(<span class="org-string">"&#21487;&#20197;&#20026; @Test &#25552;&#20379;&#19981;&#21516;&#30340;&#21442;&#25968;"</span>);
    }

    <span class="org-c-annotation">@Test</span>
    <span class="org-c-annotation">@Ignore</span>(<span class="org-string">"&#29702;&#30001;"</span>)
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">third</span>() {
        logger.debug(<span class="org-string">"@Ignore &#29992;&#26469;&#23558;&#24403;&#21069;&#27979;&#35797;&#24573;&#30053;&#25481;"</span>);
    }
}
</pre>
</div>
</div>
</section>

<section id="outline-container-org83b8775" class="outline-2">
<h2 id="org83b8775"><span class="section-number-2">3</span> JUnit 高级</h2>
<div class="outline-text-2" id="text-3">
<p>
JUnit 提供了两种对功能进行扩展的手段:
</p>
<ol class="org-ol">
<li>Rules</li>
<li>Runners</li>
</ol>

<p>
Runners 表示测试的方式:
</p>
<ol class="org-ol">
<li>如果只是测试当前类中所有的方法，那么将采取 BlockJunit4ClassRunner 的 Runner 进行测试。<b>这是默认的 Runner，不需要配置即可使用</b>。</li>
<li>如果想批量测试某一些类，那么可以采取名为 Suite 的 Runner 进行测试</li>
<li>另外，JUnit 还内置了名为 Parameterize 和 Categories 的 Runner</li>
<li>当然，我们也可以很方便实现自己的 Runner，从而指定自己的测试方案</li>
</ol>

<p>
可以通过注解 <code>@RunWith</code> 配置要使用的 Runner，比如:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@RunWith</span>(Suite.<span class="org-keyword">class</span>)
@<span class="org-constant">Suite</span>.SuiteClasses({
     ATest.<span class="org-keyword">class</span>,
     BTest.<span class="org-keyword">class</span>,
     CTest.<span class="org-keyword">class</span>
})
<span class="org-keyword">public</span> <span class="org-keyword">class</span> BatchTest {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#22914;&#26524;&#20351;&#29992; Suite Runner</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#37027;&#20040;&#20250;&#25209;&#37327;&#25191;&#34892;&#30456;&#20851;&#30340;&#27979;&#35797;&#31867;</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#20351;&#29992; Suiteclasses &#25351;&#23450;&#35201;&#25209;&#37327;&#27979;&#35797;&#30340;&#31867;&#21363;&#21487;&#12290;</span>

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#26412;&#31867;&#65292;&#19981;&#38656;&#35201;&#20889;&#20219;&#20309;&#19996;&#35199;&#65292;&#30041;&#31354;&#21363;&#21487;&#12290;</span>
}
</pre>
</div>

<p>
Spring 提供了单独的 jar 包，Spring-Test.jar:
</p>
<div class="org-src-container">
<pre class="src src-sgml">&lt;<span class="org-function-name">dependency</span>&gt;
  &lt;<span class="org-function-name">groupId</span>&gt;org.springframework&lt;/<span class="org-function-name">groupId</span>&gt;
  &lt;<span class="org-function-name">artifactId</span>&gt;spring-test&lt;/<span class="org-function-name">artifactId</span>&gt;
  &lt;<span class="org-function-name">version</span>&gt;5.1.0.RELEASE&lt;/<span class="org-function-name">version</span>&gt;
  &lt;<span class="org-function-name">scope</span>&gt;test&lt;/<span class="org-function-name">scope</span>&gt;
&lt;/<span class="org-function-name">dependency</span>&gt;
</pre>
</div>

<p>
SpringTest 实现了一个 Runner 叫 SpringRunner，可以针对 Spring 项目，简化测试:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@RunWith</span>(SpringRunner.<span class="org-keyword">class</span>)
<span class="org-c-annotation">@ContextConfiguration</span>(locations = <span class="org-string">"claspath:spring-root.xml"</span>)
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">SpringXXXTest</span> {

    <span class="org-c-annotation">@Autowired</span>
    <span class="org-type">BookService</span> <span class="org-variable-name">bookService</span>;

    <span class="org-c-annotation">@Test</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">testGetById</span>() {
        System.out.println(bookService.getById(2));
    }
}
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-01 Thu 16:24</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
